Tekla.Structures.Catalogs.ShapeItem.InsertOrGetGuidsOfShapesWithMatchingGeometry(System.Collections.Generic.List{System.String}@)
Inserts a shape to the shape catalog based on the shape geometry (does not allow duplicate geometry).
If, based on fingerprint, the geometry already exists it populates a list of Guids of shapes using that same geometry.
existingShapeGuids: A list of guids of any shapes with matching geometry fingerprints.
Returns:
Returns true on success; false if not successful.
Throws System.InvalidOperationException: Thrown if Insert failed due to an internal reason.
Throws System.ArgumentException: Thrown if the shape data is invalid (see message for more specific cause).
Throws System.ArgumentOutOfRangeException: Thrown if an implementation error occurred.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
var vertices = new[]
{
new Vector(  0.0,   0.0,   0.0), // 0
new Vector(300.0,   0.0,   0.0), // 1
new Vector(300.0, 300.0,   0.0), // 2
new Vector(  0.0, 300.0,   0.0), // 3
new Vector(  0.0,   0.0, 300.0), // 4
new Vector(300.0,   0.0, 300.0), // 5
new Vector(300.0, 300.0, 300.0), // 6
new Vector(  0.0, 300.0, 300.0), // 7
};
var outloop = new[] { new[] { 0, 3, 2, 1 },
new[] { 0, 1, 5, 4 },
new[] { 1, 2, 6, 5 },
new[] { 2, 3, 7, 6 },
new[] { 3, 0, 4, 7 },
new[] { 4, 5, 6, 7 }};
var innerLoop = new Dictionary{int, int[][]}
{
};
var brep = new FacetedBrep(vertices, outloop, innerLoop);
var shapeItem1 = new ShapeItem
{
Name = "MyNiceCubeBrep1",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = shapeItem1.Insert();
System.Diagnostics.Debug.Assert(result, $"Failed to insert {shapeItem1.Name}.");
var shapeItem2 = new ShapeItem
{
Name = "MyNiceCubeBrep2",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
List{string} existingGuids;
result = shapeItem2.InsertOrGetGuidsOfShapesWithMatchingGeometry(out existingGuids);
System.Diagnostics.Debug.Assert(!result, $"Should have failed to insert {shapeItem2.Name}.");
System.Diagnostics.Debug.Assert(
existingGuids.Contains(shapeItem1.Guid),
$"{nameof(existingGuids)} should have conatined{shapeItem1.Guid}.");
}

Tekla.Structures.Catalogs.ShapeItem.SetMetadata(System.String,Tekla.Structures.Catalogs.ShapeMetadataTypeEnum,System.Object,System.String,System.String)
Set the Shape item's metadata. Inserts the metadata if key is not found, otherwise modifies existing data.
key: The key of metadata.
type: The type of metadata.
value: The value of metadata.
label: The label of metadata.
description: The description of metadata.
public void SetMetadataTest()
{
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestFileName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
shapeItem.SetMetadata("test", ShapeMetadataTypeEnum.Text, "testvalue", "", "");
}
Returns: True if success or False

Tekla.Structures.Catalogs.ShapeItem.GetAllMetadataKeys
Get the Shape item's metadata keys.
public void SetMetadataTest()
{
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestFileName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
var keys = shapeItem.GetAllMetadataKeys();
}
Returns: A list of strings containing the keys.

Tekla.Structures.Catalogs.ShapeItem.GetMetadata(System.String,Tekla.Structures.Catalogs.ShapeMetadataTypeEnum@,System.Object@,System.String@,System.String@)
Get the Shape item's metadata.
key: The key of metadata.
type: The type of metadata.
value: The value of metadata.
label: The label of metadata.
description: The description of metadata.
public void SetMetadataTest()
{
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestFileName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
shapeItem.SetMetadata("test", ShapeMetadataTypeEnum.Text, "testvalue", "teststring", "");
object value = null;
ShapeMetadataTypeEnum type = ShapeMetadataTypeEnum.Text;
string label = string.Empty;
string desc = string.Empty;
shapeItem.GetMetadata("test", ref type, ref value, ref label, ref desc);
}
Returns: True if success or False

Tekla.Structures.Catalogs.ShapeItem.DeleteMetadata(System.String)
Delete the Shape item's metadata.
key: The key of metadata.
public void SetMetaDataTest()
{
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestFileName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
shapeItem.SetMetadata("test", ShapeMetadataTypeEnum.Text, "testvalue", "", "");
shapeItem.DeleteMetadata("test");
}
Returns: True if success or False if key not found or deletion failed.